---
title: WireSize
classe: Autodesk.Revit.DB.Electrical.WireSize
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# WireSize

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int64 Ampacity { get; }` | `wireSize.Ampacity` | Int64 |
| `Double Diameter { get; }` | `wireSize.Diameter` | Double |
| `Boolean InUse { get; set; }` | `wireSize.InUse` | Boolean |
| `String Size { get; }` | `wireSize.Size` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```